insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values('На солнце, вдоль рядов кукурузы',
        'История о небе, несбыточной мечте и подвиге, поразившем весь мир. Дамир Юсупов и предположить не мог, что однажды станет настоящим героем… Обыкновенный мальчишка, он грезил полетами и был уверен, что пойдет по стопам своего отца-летчика, но судьба распорядилась иначе. Спустя годы, когда веру потеряли даже самые близкие люди, Дамир все-таки сумел воплотить заветную мечту и стал пилотом гражданской авиации. И только благодаря его мужеству и преданности любимому делу были спасены 233 жизни: в августе 2019 г., когда у самолета отказали оба двигателя, он сумел посадить его на кукурузное поле…',
        2023, 18, 6, 90, 9);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values('Человек-муравей и Оса: Квантомания',
        'О приключениях бывшего мелкого преступника Скотта Лэнга, ставшего обладателем костюма, позволяющего уменьшаться и увеличиваться в размерах. Вместе с напарницей Хоуп ван Дайн, дочерью известного физика и энтомолога Хэнка Пима, разработавшего костюм человека-муравья, Скотт вновь спасает мир от предстоящей угрозы.',
        2023, 16, 16, 125, 5);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values('Поехавшая',
        'После череды неурядиц Аня Смолина решает полностью изменить свою жизнь. Она достает запылившийся велосипед, сажает в прицеп свою таксу Капу и отправляется в Магадан – мириться с мамой, с которой они не общались 13 лет. Жительница мегаполиса, Аня не готова к дороге в 10 тысяч километров, стертым в кровь ногам, опасностям и испытаниям. Она поймет это уже в пути. Но не повернет назад. Сможет ли Аня довериться судьбе и справиться с трудностями, которые ей приготовила долгая дорога, полная невероятных встреч и удивительных пейзажей?',
        2023, 9, 16, 106, 11);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values('Праведник',
        '1942 год. Офицер Красной Армии Николай Киселев получает приказ вывести с оккупированных белорусских земель за линию фронта свыше двухсот евреев — стариков, женщин и детей, чудом избежавших неминуемой жестокой расправы. Этим истощенным, измученным голодом и страхом людям, потерявшим родных и едва не сошедшим с ума от пережитого ужаса, предстоит пройти пешком по лесным тропам сотни километров, чтобы вновь обрести надежду на спасение и веру в будущее.',
        2023, 6, 12, 160, 12);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values('Нюрнберг',
        '1945 год. В Нюрнберге начинает работу Международный военный трибунал. На суд, который впоследствии назовут «Процессом века», съезжается огромное количество людей со всего мира: город переполнен участниками процесса и журналистами. Среди тех, кто приезжает в Нюрнберг в составе советской делегации — владеющий несколькими иностранными языками капитан Волгин. Он еще молод, но уже прошел войну… Однажды на улице города Игорь встречает юную русскую девушку Лену. Их зарождающееся чувство пройдет через множество испытаний, но любовь — это единственное, что во все времена спасало мир от расчеловечивания.',
        2023, 7, 12, 135, 10);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values('Аватар: Путь воды',
        'Прошло больше десяти лет с момента событий первого фильма. Новый эпизод фантастической саги «Аватар: Путь воды» начинает повествование о приключениях семьи Салли — Джейка, Нейтири и их детей. Испытания, выпавшие на их долю, битвы, в которых им предстоит сразиться, и трагедии, которые им предстоит пережить — ради спасения друг друга они готовы ко всему.',
        2022, 16, 16, 206, 1);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values('Беспринципные в деревне',
        'Генералу Хадякову стукнуло 60 лет, и он решает отпраздновать юбилей не на Патриках, а в настоящей русской деревне — с полным погружением, праздничной трапезой, баней, рыбалкой и деревенским спа. Приглашены все любимые герои, но праздник идёт не по плану. Жители Патриков умудряются настроить против себя местных жителей, переругаться между собой и остаться без пропитания.',
        2023, 8, 16, 100, 2);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values('Кот в сапогах: Последнее желание',
        'Схватки, погони, женщины. Враги, друзья, интриги. Шпага, шпоры, шляпа. И ко всему этому – яркая внешность мачо. Вот вам и набросок к портрету самого обворожительного анимационного героя. Добавим сорок разбойников, смертельные опасности, крутые виражи судьбы и получим новую картину о Коте в сапогах.',
        2022, 12, 16, 104, 8);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values('Чебурашка',
        'Иногда, чтобы вернуть солнце и улыбки в мир взрослых, нужен один маленький ушастый герой! Мохнатого непоседливого зверька из далекой апельсиновой страны ждут удивительные приключения в тихом приморском городке, где ему предстоит найти себе имя, друзей и дом. Помогать – и мешать! – ему в этом будут нелюдимый старик-садовник, странная тетя-модница и ее капризная внучка, мальчик, который никак не начнет говорить, и его мама, которой приходится несладко, хотя она и варит самый вкусный на свете шоколад. И многие-многие другие, в чью жизнь вместе с ароматом апельсинов вот-вот ворвутся волшебство и приключения!',
        2023, 13, 6, 120, 4);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values('Царевны и таинственная гостья',
        'Приключения ждут царевен во время празднования Всеволшебного дня. В школе ждут бал: мальчики готовят сюрприз, а царевны примеряют костюмы животных. Но не успевает торжество начаться, как на школу нападает юная волшебница Марфуша, у которой с учебным заведением свои счёты. Застав Кощея врасплох, она превращает его в ворона, а бросившихся ему на выручку царевен — в зверей, костюмы которых они надели. Теперь до конца Всеволшебного дня царевны должны вернуть себе и Кощею настоящий облик, иначе они навсегда останутся животными. Но как это сделать, если теперь они лишены своих волшебных способностей?',
        2023, 1, 0, 72, 3);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values('Эскортница',
        'Действие фильма происходит в течение одной ночи в Москве и Дубае. Для всех вокруг Кристина организатор выставок современного искусства, на деле же она организует развлечения для богатых клиентов в самых экзотических местах. На нее работают десятки «элитных» девушек со всего мира. Когда-то в прошлом Кристина тоже работала «хостес» на подобных вечеринках, но, будучи очень амбициозной, она несколько лет назад полностью сменила свой имидж и превратилась в «менеджера» экстра-класса. Благодаря своему активному и коммуникабельному характеру, ей удается всегда быть на гребне волны, заводить новые связи, получать очень богатых клиентов. Но у этой работы есть и обратная сторона – постоянное присутствие криминала, полиции и спецслужб в ее жизни. А также периодические срывы и интриги подопечных девушек, пытающихся оторвать кусок пирога побольше.',
        2023, 14, 18, 90, 7);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values('Сергий против нечисти. Шабаш',
        'Сергию и Кате предстоит сразиться со свирепой фольклорной нечистью — генно-модифицированным Змеем Горынычем, бандой домовых, терроризирующих людей, а также дать отпор самому Вию, который пытается взять власть в свои руки. Они продолжат и личную борьбу: Катя попытается избавить Сергия от очень вредных привычек, а Сергий — растопить сердце Кати.',
        2023, 10, 18, 100, 13);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values('Дети кукурузы',
        'В небольшом городке штата Небраска практически никогда ничего не происходит. Но все меняется, когда местные жители решают избавиться от кукурузных полей, которые теперь приносят лишь убыток. По необъяснимой причине дети не желают, чтобы поля сожгли, и устраивают настоящую резню. Но кто в действительности стоит за этой кровавой бойней?',
        2020, 17, 18, 93, 6);

insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values('Стражи времени',
        'Однажды в семейном поместье четверо сестер обнаруживают проход, ведущий в загадочный мир. Попав туда, и оказавшись в Королевстве Кеохерус, они должны стать предсказанными героями - Хранителям Времени. Чтобы вернуться домой им предстоит столкнуться с темными силами и волшебными созданиями.',
        2023, 12, 6, 99, 14);


